src/cf/Documents/уатАктПриемаПередачиТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатАктПриемаПередачиТС</Name>
			<BasedOn>
				<xr:Item>Document.уатПутевойЛист</xr:Item>
				<xr:Item>Document.уатДТП</xr:Item>
				<xr:Item>Document.уатЗаявкаНаРемонт</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.уатРезультатыОсмотраАгрегатовИЭлементов</xr:Item>
				<xr:Item>InformationRegister.уатКузовныеЭлементыТС</xr:Item>
				<xr:Item>AccumulationRegister.уатЭлементыКомплектации_уэ</xr:Item>
				<xr:Item>InformationRegister.уатАгрегатыТС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатВидыОперацийАктПриемаПередачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение организации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОсмотра</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТС</Name>
					<Comment>ТС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прицеп1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прицеп2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеСалонаТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСостоянияСалонаТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеГрузовогоОтсекаПрицепа1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСостоянияСалонаТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеГрузовогоОтсекаПрицепа2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСостоянияСалонаТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сдал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принял</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсмотрПровел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктОсмотраТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатДТП</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПутевойЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.уатЗаявкаНаРемонт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь, ответственный за документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПримечаниеКСостояниюСалонаТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПримечаниеКСостояниюГрузовогоОтсекаПрицепа1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПримечаниеКСостояниюГрузовогоОтсекаПрицепа2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутевойЛист1</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатПутевойЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутевойЛист2</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатПутевойЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Одометр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокТоплива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Замечания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Шины</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уатСостоянияАгрегатов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоУстановки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатМестаУстановкиШин</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтепеньИзноса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Агрегаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уатСостоянияАгрегатов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КузовныеЭлементы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КузовнойЭлемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСостоянияЭлементовТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаличиеПовреждений</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактерПовреждений</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатХарактерыПовреждений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭлементыКомплектации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭлементКомплектации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСостоянияЭлементовТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаличиеПовреждений</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактерПовреждений</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатХарактерыПовреждений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеПредыдущее</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСостоянияЭлементовТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаличиеПоврежденийПредыдущее</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактерПоврежденийПредыдущий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатХарактерыПовреждений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПредыдущее</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтветственныеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/уатАгрегатыТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатАгрегатыТС</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МестоУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатМестаУстановкиШин</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеАгрегата</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатСостоянияАгрегатов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТС</Name>
					<Comment>В составе ТС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтепеньИзноса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МОЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьМОЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/уатТипыЭлементовАктаОсмотра.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатТипыЭлементовАктаОсмотра</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Шина</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Агрегат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КузовнойЭлемент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлементКомплектации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/уатАктПриемаПередачиТС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	Настройки.ПриПолученииСлужебныхРеквизитов = Ложь;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.уатАктПриемаПередачиТС";
	КомандаПечати.Идентификатор = "АктПриемаПередачиТС";
	КомандаПечати.Представление = НСтр("en='Report';ru='Акт'");
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.уатАктПриемаПередачиТС";
	КомандаПечати.Идентификатор = "АктПриемаПередачиТСПредыдущееСостояние";
	КомандаПечати.Представление = НСтр("en='Report (template with previous condition)';ru='Акт (шаблон с предыдущим состоянием)'");
		                                                                         
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной
//                                                            параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной
//                                            параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если НЕ уатОбщегоНазначенияСервер.РазрешениеПечатиНепроведенногоДокумента(МассивОбъектов) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктПриемаПередачиТС") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктПриемаПередачиТС",
			"Акт приема-передачи ТС", ПечатьАктПриемаПередачиТС(МассивОбъектов, ОбъектыПечати));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктПриемаПередачиТСПредыдущееСостояние") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктПриемаПередачиТСПредыдущееСостояние",
			"Акт приема-передачи ТС (шаблон с предыдущим состоянием)", ПечатьАктПриемаПередачиТСПредыдущееСостояние(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
	уатОбщегоНазначенияСервер.УстановитьРедактированиеПечатныхФормДокумента(КоллекцияПечатныхФорм);
		
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.УправлениеДоступом

// Позволяет переопределить ограничение, указанное в модуле менеджера объекта метаданных.
//
// Параметры:
//  Ограничение - Структура:
//    * Текст                             - Строка - ограничение доступа для пользователей.
//                                          Если пустая строка, значит, доступ разрешен.
//    * ТекстДляВнешнихПользователей      - Строка - ограничение доступа для внешних пользователей.
//                                          Если пустая строка, значит, доступ запрещен.
//    * ПоВладельцуБезЗаписиКлючейДоступа - Неопределено - определить автоматически.
//                                        - Булево - если Ложь, то всегда записывать ключи доступа,
//                                          если Истина, тогда не записывать ключи доступа,
//                                          а использовать ключи доступа владельца (требуется,
//                                          чтобы ограничение было строго по объекту-владельцу).
//   * ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей - Неопределено, Булево - также
//                                          как у параметра ПоВладельцуБезЗаписиКлючейДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Подразделение)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ВариантыОтчетов

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	СформироватьТаблицуАгрегатыТС(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицуКузовныеЭлементы(ДокументСсылка, СтруктураДополнительныеСвойства);
	Если уатОбщегоНазначения_проф.ИспользоватьЭлементыКомплектации() Тогда
		ОМ_уатОбщегоНазначения_уэ = ОбщегоНазначения.ОбщийМодуль("уатОбщегоНазначения_уэ");
		ОМ_уатОбщегоНазначения_уэ.СформироватьТаблицуЭлементыКомплектации_АктПриемаПередачи(
			ДокументСсылка, СтруктураДополнительныеСвойства);
	КонецЕсли;
	СформироватьТаблицуРезультатыОсмотраАгрегатовИЭлементов(ДокументСсылка, СтруктураДополнительныеСвойства);
		
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуАгрегатыТС(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	мЗапрос = Новый Запрос;
	мЗапрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	мЗапрос.УстановитьПараметр("ПериодПред", ДокументСсылка.ДатаОсмотра-1);
	мЗапрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатАктПриемаПередачиТСШины.Ссылка.ДатаОсмотра КАК Период,
	|	уатАктПриемаПередачиТСШины.Ссылка КАК Регистратор,
	|	уатАктПриемаПередачиТСШины.ТС КАК ТС,
	|	уатАктПриемаПередачиТСШины.СерияНоменклатуры КАК СерияНоменклатуры,
	|	уатАктПриемаПередачиТСШины.МестоУстановки КАК МестоУстановки,
	|	уатАктПриемаПередачиТСШины.Состояние КАК СостояниеАгрегата,
	|	уатАктПриемаПередачиТСШины.СтепеньИзноса КАК СтепеньИзноса,
	|	уатАктПриемаПередачиТСШины.Ссылка КАК Ссылка,
	|	уатАгрегатыТССрезПоследних.МОЛ КАК МОЛ
	|ИЗ
	|	Документ.уатАктПриемаПередачиТС.Шины КАК уатАктПриемаПередачиТСШины
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатАгрегатыТС.СрезПоследних(&ПериодПред) КАК уатАгрегатыТССрезПоследних
	|	ПО уатАктПриемаПередачиТСШины.СерияНоменклатуры = уатАгрегатыТССрезПоследних.СерияНоменклатуры
	|ГДЕ
	|	уатАктПриемаПередачиТСШины.Ссылка = &Ссылка
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	уатАктПриемаПередачиТСАгрегаты.Ссылка.ДатаОсмотра,
	|	уатАктПриемаПередачиТСАгрегаты.Ссылка,
	|	уатАктПриемаПередачиТСАгрегаты.ТС,
	|	уатАктПриемаПередачиТСАгрегаты.СерияНоменклатуры,
	|	НЕОПРЕДЕЛЕНО,
	|	уатАктПриемаПередачиТСАгрегаты.Состояние,
	|	НЕОПРЕДЕЛЕНО,
	|	уатАктПриемаПередачиТСАгрегаты.Ссылка,
	|	уатАгрегатыТССрезПоследних.МОЛ
	|ИЗ
	|	Документ.уатАктПриемаПередачиТС.Агрегаты КАК уатАктПриемаПередачиТСАгрегаты
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатАгрегатыТС.СрезПоследних(&ПериодПред) КАК уатАгрегатыТССрезПоследних
	|	ПО уатАктПриемаПередачиТСАгрегаты.СерияНоменклатуры = уатАгрегатыТССрезПоследних.СерияНоменклатуры
	|ГДЕ
	|	уатАктПриемаПередачиТСАгрегаты.Ссылка = &Ссылка
	|";
	тблАгрегатыТС = мЗапрос.Выполнить().Выгрузить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаАгрегатовТС", тблАгрегатыТС);
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру КузовныеЭлементы.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуКузовныеЭлементы(ДокументСсылка, СтруктураДополнительныеСвойства)

	мЗапрос = Новый Запрос;
	мЗапрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	мЗапрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатАктПриемаПередачиТСКузовныеЭлементы.Ссылка.ДатаОсмотра КАК Период,
	|	уатАктПриемаПередачиТСКузовныеЭлементы.Ссылка КАК Регистратор,
	|	уатАктПриемаПередачиТСКузовныеЭлементы.ТС КАК ТС,
	|	уатАктПриемаПередачиТСКузовныеЭлементы.КузовнойЭлемент КАК КузовнойЭлемент,
	|	уатАктПриемаПередачиТСКузовныеЭлементы.НаличиеПовреждений КАК НаличиеПовреждений,
	|	уатАктПриемаПередачиТСКузовныеЭлементы.ХарактерПовреждений КАК ХарактерПовреждений,
	|	уатАктПриемаПередачиТСКузовныеЭлементы.Состояние КАК Состояние
	|ИЗ
	|	Документ.уатАктПриемаПередачиТС.КузовныеЭлементы КАК уатАктПриемаПередачиТСКузовныеЭлементы
	|ГДЕ
	|	уатАктПриемаПередачиТСКузовныеЭлементы.Ссылка = &Ссылка";
	тблКузовныеЭлементыТС = мЗапрос.Выполнить().Выгрузить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаКузовныеЭлементыТС", тблКузовныеЭлементыТС);
		
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру РезультатыОсмотраАгрегатовИЭлементов.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуРезультатыОсмотраАгрегатовИЭлементов(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	мЗапросРезультатыОсмотра = Новый Запрос;
	мЗапросРезультатыОсмотра.УстановитьПараметр("Ссылка", ДокументСсылка);
	мЗапросРезультатыОсмотра.УстановитьПараметр("ПериодПред", ДокументСсылка.ДатаОсмотра-1);
	мЗапросРезультатыОсмотра.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатАктПриемаПередачиТСШины.Ссылка.Дата КАК Период,
	|	уатАктПриемаПередачиТСШины.Ссылка КАК Регистратор,
	|	ЗНАЧЕНИЕ(Перечисление.уатТипыЭлементовАктаОсмотра.Шина) КАК ТипЭлемента,
	|	уатАктПриемаПередачиТСШины.Ссылка.ТС КАК ТС,
	|	уатАктПриемаПередачиТСШины.Ссылка.Сдал КАК Сдал,
	|	уатАктПриемаПередачиТСШины.Ссылка.Принял КАК Принял,
	|	уатАктПриемаПередачиТСШины.Ссылка.ОсмотрПровел КАК ОсмотрПровел,
	|	уатАктПриемаПередачиТСШины.СерияНоменклатуры КАК АгрегатЭлемент,
	|	уатАктПриемаПередачиТСШины.Состояние КАК Состояние,
	|	NULL КАК НаличиеПовреждений,
	|	NULL КАК ХарактерПовреждений,
	|	1 КАК Количество,
	|	уатАктПриемаПередачиТСШины.МестоУстановки КАК МестоУстановки,
	|	уатАктПриемаПередачиТСШины.СтепеньИзноса КАК СтепеньИзноса,	
	|	уатАктПриемаПередачиТСШины.МестоУстановки <> ЕСТЬNULL(уатАгрегатыТСПред.МестоУстановки, НЕОПРЕДЕЛЕНО)
	|		ИЛИ уатАктПриемаПередачиТСШины.СтепеньИзноса <> ЕСТЬNULL(уатАгрегатыТСПред.СтепеньИзноса, НЕОПРЕДЕЛЕНО)
	|		ИЛИ уатАктПриемаПередачиТСШины.Состояние <> ЕСТЬNULL(уатАгрегатыТСПред.СостояниеАгрегата, НЕОПРЕДЕЛЕНО) КАК Изменен
	|ИЗ
	|	Документ.уатАктПриемаПередачиТС.Шины КАК уатАктПриемаПередачиТСШины
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатАгрегатыТС.СрезПоследних(&ПериодПред) КАК уатАгрегатыТСПред
	|	ПО уатАктПриемаПередачиТСШины.СерияНоменклатуры = уатАгрегатыТСПред.СерияНоменклатуры
	|	И уатАктПриемаПередачиТСШины.ТС = уатАгрегатыТСПред.ТС
	|ГДЕ
	|	уатАктПриемаПередачиТСШины.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	уатАктПриемаПередачиТСАгрегаты.Ссылка.Дата,
	|	уатАктПриемаПередачиТСАгрегаты.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.уатТипыЭлементовАктаОсмотра.Агрегат),
	|	уатАктПриемаПередачиТСАгрегаты.Ссылка.ТС,
	|	уатАктПриемаПередачиТСАгрегаты.Ссылка.Сдал,
	|	уатАктПриемаПередачиТСАгрегаты.Ссылка.Принял,
	|	уатАктПриемаПередачиТСАгрегаты.Ссылка.ОсмотрПровел,
	|	уатАктПриемаПередачиТСАгрегаты.СерияНоменклатуры,
	|	уатАктПриемаПередачиТСАгрегаты.Состояние,
	|	NULL,
	|	NULL,
	|	1,
	|	NULL,
	|	NULL,
	|	уатАктПриемаПередачиТСАгрегаты.Состояние <> ЕСТЬNULL(уатАгрегатыТСПред.СостояниеАгрегата, НЕОПРЕДЕЛЕНО)
	|ИЗ
	|	Документ.уатАктПриемаПередачиТС.Агрегаты КАК уатАктПриемаПередачиТСАгрегаты
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатАгрегатыТС.СрезПоследних(&ПериодПред) КАК уатАгрегатыТСПред
	|	ПО уатАктПриемаПередачиТСАгрегаты.СерияНоменклатуры = уатАгрегатыТСПред.СерияНоменклатуры
	|	И уатАктПриемаПередачиТСАгрегаты.ТС = уатАгрегатыТСПред.ТС
	|ГДЕ
	|	уатАктПриемаПередачиТСАгрегаты.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	уатАктПриемаПередачиТСКузовныеЭлементы.Ссылка.Дата,
	|	уатАктПриемаПередачиТСКузовныеЭлементы.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.уатТипыЭлементовАктаОсмотра.КузовнойЭлемент),
	|	уатАктПриемаПередачиТСКузовныеЭлементы.Ссылка.ТС,
	|	уатАктПриемаПередачиТСКузовныеЭлементы.Ссылка.Сдал,
	|	уатАктПриемаПередачиТСКузовныеЭлементы.Ссылка.Принял,
	|	уатАктПриемаПередачиТСКузовныеЭлементы.Ссылка.ОсмотрПровел,
	|	уатАктПриемаПередачиТСКузовныеЭлементы.КузовнойЭлемент,
	|	уатАктПриемаПередачиТСКузовныеЭлементы.Состояние,
	|	уатАктПриемаПередачиТСКузовныеЭлементы.НаличиеПовреждений,
	|	уатАктПриемаПередачиТСКузовныеЭлементы.ХарактерПовреждений,
	|	1,
	|	NULL,
	|	NULL,
	|	уатАктПриемаПередачиТСКузовныеЭлементы.НаличиеПовреждений <> ЕСТЬNULL(уатКузовныеЭлементыТСПред.НаличиеПовреждений, НЕОПРЕДЕЛЕНО)
	|		ИЛИ уатАктПриемаПередачиТСКузовныеЭлементы.ХарактерПовреждений <> ЕСТЬNULL(уатКузовныеЭлементыТСПред.ХарактерПовреждений, НЕОПРЕДЕЛЕНО)
	|		ИЛИ уатАктПриемаПередачиТСКузовныеЭлементы.Состояние <> ЕСТЬNULL(уатКузовныеЭлементыТСПред.Состояние, НЕОПРЕДЕЛЕНО)
	|ИЗ
	|	Документ.уатАктПриемаПередачиТС.КузовныеЭлементы КАК уатАктПриемаПередачиТСКузовныеЭлементы
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатКузовныеЭлементыТС.СрезПоследних(&ПериодПред) КАК уатКузовныеЭлементыТСПред
	|	ПО уатАктПриемаПередачиТСКузовныеЭлементы.ТС = уатКузовныеЭлементыТСПред.ТС
	|	И уатАктПриемаПередачиТСКузовныеЭлементы.КузовнойЭлемент = уатКузовныеЭлементыТСПред.КузовнойЭлемент
	|ГДЕ
	|	уатАктПриемаПередачиТСКузовныеЭлементы.Ссылка = &Ссылка";
	Если уатОбщегоНазначения_проф.ИспользоватьЭлементыКомплектации() Тогда
		ОМ_уатОбщегоНазначения_уэ = ОбщегоНазначения.ОбщийМодуль("уатОбщегоНазначения_уэ");
		ОМ_уатОбщегоНазначения_уэ.ДобавитьКЗапросуЭлементыКомплектации_АктПриемаПередачи(мЗапросРезультатыОсмотра.Текст);
	КонецЕсли;
	тблРезультатыОсмотраАгрегатовИЭлементов = мЗапросРезультатыОсмотра.Выполнить().Выгрузить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРезультатыОсмотраАгрегатовИЭлементов", тблРезультатыОсмотраАгрегатовИЭлементов);
	
КонецПроцедуры
	
Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	Заголовок = уатОбщегоНазначенияТиповые.уатПредставлениеДокументаПриПроведении(ДокументСсылка);
		
	// Формируем общую таблицу агрегатов.
	тблАгрегаты = ДокументСсылка.Шины.Выгрузить();
	// Ищем строки снято-запас для одной серии номенклатуры.
	мсвЗапас = тблАгрегаты.НайтиСтроки(Новый Структура("Состояние", Перечисления.уатСостоянияАгрегатов.УстановленоВЗапас));
	Для Каждого ТекЗапас Из мсвЗапас Цикл
		мсвСнято = тблАгрегаты.НайтиСтроки(Новый Структура("СерияНоменклатуры, Состояние", ТекЗапас.СерияНоменклатуры, Перечисления.уатСостоянияАгрегатов.Снято));
		Для Каждого ТекСнято Из мсвСнято Цикл
			тблАгрегаты.Удалить(ТекСнято);
		КонецЦикла;
	КонецЦикла;
	мсвПерестановка = тблАгрегаты.НайтиСтроки(Новый Структура("Состояние", Перечисления.уатСостоянияАгрегатов.УстановленоВРаботе));
	Для Каждого ТекЗапас Из мсвПерестановка Цикл
		мсвСнято = тблАгрегаты.НайтиСтроки(Новый Структура("СерияНоменклатуры, Состояние", ТекЗапас.СерияНоменклатуры, Перечисления.уатСостоянияАгрегатов.Снято));
		Для Каждого ТекСнято Из мсвСнято Цикл
			тблАгрегаты.Удалить(ТекСнято);
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого ТекАгрегат Из ДокументСсылка.Агрегаты Цикл
		НоваяСтрокаАгрегат = тблАгрегаты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаАгрегат, ТекАгрегат);
	КонецЦикла;
	
	текМоментВремени  = Новый Граница(ДокументСсылка.ДатаОсмотра, ВидГраницы.Включая);
	предМоментВремени = Новый Граница(ДокументСсылка.ДатаОсмотра, ВидГраницы.Исключая);
	
	тблШиныТС 			            = уатОбщегоНазначения.уатШиныТС(ДокументСсылка.ТС, текМоментВремени);
	тблШиныТС_доРемонта 		    = уатОбщегоНазначения.уатШиныТС(ДокументСсылка.ТС, предМоментВремени);
	тблАгрегатыТСКромеШин           = уатОбщегоНазначения.уатАгрегатыТСКромеШин(ДокументСсылка.ТС, текМоментВремени);
	тблАгрегатыТСКромеШин_доРемонта = уатОбщегоНазначения.уатАгрегатыТСКромеШин(ДокументСсылка.ТС, предМоментВремени);
	Если ЗначениеЗаполнено(ДокументСсылка.Прицеп1) Тогда
		тблШиныПрицеп1		                 = уатОбщегоНазначения.уатШиныТС(ДокументСсылка.Прицеп1, текМоментВремени);
		тблШиныПрицеп1_доРемонта 		     = уатОбщегоНазначения.уатШиныТС(ДокументСсылка.Прицеп1, предМоментВремени);
		тблАгрегатыПрицеп1КромеШин           = уатОбщегоНазначения.уатАгрегатыТСКромеШин(ДокументСсылка.Прицеп1, текМоментВремени);
		тблАгрегатыПрицеп1КромеШин_доРемонта = уатОбщегоНазначения.уатАгрегатыТСКромеШин(ДокументСсылка.Прицеп1, предМоментВремени);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДокументСсылка.Прицеп2) Тогда
		тблШиныПрицеп2		                 = уатОбщегоНазначения.уатШиныТС(ДокументСсылка.Прицеп2, текМоментВремени);
		тблШиныПрицеп2_доРемонта 		     = уатОбщегоНазначения.уатШиныТС(ДокументСсылка.Прицеп2, предМоментВремени);
		тблАгрегатыПрицеп2КромеШин           = уатОбщегоНазначения.уатАгрегатыТСКромеШин(ДокументСсылка.Прицеп2, текМоментВремени);
		тблАгрегатыПрицеп2КромеШин_доРемонта = уатОбщегоНазначения.уатАгрегатыТСКромеШин(ДокументСсылка.Прицеп2, предМоментВремени);
	КонецЕсли;
	
	Для Каждого ТекСтрокаАгрегат Из тблАгрегаты Цикл
		Если ЗначениеЗаполнено(ДокументСсылка.Прицеп1) И ТекСтрокаАгрегат.ТС = ДокументСсылка.Прицеп1 Тогда
			тблШины_доРемонта = тблШиныПрицеп1_доРемонта;
			тблАгрегатыКромеШин_доРемонта = тблАгрегатыПрицеп1КромеШин_доРемонта;
		ИначеЕсли ЗначениеЗаполнено(ДокументСсылка.Прицеп2) И ТекСтрокаАгрегат.ТС = ДокументСсылка.Прицеп2 Тогда
			тблШины_доРемонта = тблШиныПрицеп2_доРемонта;
			тблАгрегатыКромеШин_доРемонта = тблАгрегатыПрицеп2КромеШин_доРемонта;
		Иначе
			тблШины_доРемонта = тблШиныТС_доРемонта;
			тблАгрегатыКромеШин_доРемонта = тблАгрегатыТСКромеШин_доРемонта;
		КонецЕсли;
		
		// Проверяем наличие агрегата на ТС (для снимаемых агрегатов).
		Если ТекСтрокаАгрегат.Состояние = Перечисления.уатСостоянияАгрегатов.Снято Тогда
			Если (ТекСтрокаАгрегат.СерияНоменклатуры.ТипАгрегата = Справочники.уатТипыАгрегатов.Шина
				И тблШины_доРемонта.Найти(ТекСтрокаАгрегат.СерияНоменклатуры, "СерияНоменклатуры") = Неопределено)
				ИЛИ 
				(ТекСтрокаАгрегат.СерияНоменклатуры.ТипАгрегата <> Справочники.уатТипыАгрегатов.Шина
				И тблАгрегатыКромеШин_доРемонта.Найти(ТекСтрокаАгрегат.СерияНоменклатуры, "СерияНоменклатуры") = Неопределено) Тогда
				
				Если ТекСтрокаАгрегат.СерияНоменклатуры.Модель.ТипАгрегата = Справочники.уатТипыАгрегатов.Аккумулятор тогда
					ТекстНСТР = НСтр("en='Battery ""%1"" is not in vehicle ""%2""';ru='Аккумулятор ""%1"" отсутствует на ТС ""%2""'");
				ИначеЕсли ТекСтрокаАгрегат.СерияНоменклатуры.Модель.ТипАгрегата = Справочники.уатТипыАгрегатов.Шина тогда
					ТекстНСТР = НСтр("en='Tire ""%1"" is not in vehicle ""%2""';ru='Шина ""%1"" отсутствует на ТС ""%2""'");
				Иначе
					ТекстНСТР = НСтр("en='Car part ""%1"" is not on vehicle ""%2""';ru='Агрегат ""%1"" отсутствует на ТС ""%2""'");
				КонецЕсли;
				ТекстНСТР = СтрШаблон(ТекстНСТР, ТекСтрокаАгрегат.СерияНоменклатуры, Строка(ТекСтрокаАгрегат.ТС));
				
				уатОбщегоНазначенияТиповые.СообщитьОбОшибке(ТекстНСТР, Отказ, Заголовок);
			КонецЕсли;
		КонецЕсли;
		
		// Проверка установки агрегата, который уже был до этого установлен на другое ТС (для устанавливаемых агрегатов).
		Если ТекСтрокаАгрегат.Состояние = Перечисления.уатСостоянияАгрегатов.УстановленоВРаботе
			ИЛИ ТекСтрокаАгрегат.Состояние = Перечисления.уатСостоянияАгрегатов.УстановленоВЗапас Тогда
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	уатАгрегатыТССрезПоследних.ТС,
			|	уатАгрегатыТССрезПоследних.СостояниеАгрегата
			|ИЗ
			|	РегистрСведений.уатАгрегатыТС.СрезПоследних(
			|			&МоментВремени,
			|			СерияНоменклатуры = &СерияНоменклатуры
			|				И ТС <> &ТС) КАК уатАгрегатыТССрезПоследних");
			Запрос.УстановитьПараметр("МоментВремени", текМоментВремени);
			Запрос.УстановитьПараметр("СерияНоменклатуры", ТекСтрокаАгрегат.СерияНоменклатуры);
			Запрос.УстановитьПараметр("ТС", ТекСтрокаАгрегат.ТС);
			тблПересекТС = Запрос.Выполнить().Выгрузить();
			Для Каждого ТекСтрокаПересекТС Из тблПересекТС Цикл
				Если ТекСтрокаПересекТС.СостояниеАгрегата = Перечисления.уатСостоянияАгрегатов.УстановленоВРаботе
					ИЛИ ТекСтрокаПересекТС.СостояниеАгрегата = Перечисления.уатСостоянияАгрегатов.УстановленоВЗапас Тогда
					
					Если ТекСтрокаАгрегат.СерияНоменклатуры.ТипАгрегата = Справочники.уатТипыАгрегатов.Аккумулятор тогда
						ТекстНСТР = НСтр("en='Battery ""%1"" is already installed on the ""%2""';ru='Аккумулятор ""%1"" уже установлен на ТС ""%2""'");
					ИначеЕсли ТекСтрокаАгрегат.СерияНоменклатуры.ТипАгрегата = Справочники.уатТипыАгрегатов.Шина тогда
						ТекстНСТР = НСтр("en='Tire ""%1"" is already installed on vehicle ""%2""';ru='Шина ""%1"" уже установлена на ТС ""%2""'");
					Иначе
						ТекстНСТР = НСтр("en='Car part ""%1"" is already installed on vehicle ""%2""';ru='Агрегат ""%1"" уже установлен на ТС ""%2""'");
					КонецЕсли;
					ТекстНСТР = СтрШаблон(ТекстНСТР, ТекСтрокаАгрегат.СерияНоменклатуры, Строка(ТекСтрокаПересекТС.ТС));
					
					уатОбщегоНазначенияТиповые.СообщитьОбОшибке(ТекстНСТР, Отказ, Заголовок);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
		
	// Проверка установки агрегата на уже занятое место установки.
	// Здесь просто сообщаем об этом, но не отменяем проведение (для устанавливаемых агрегатов).
	Если НЕ Отказ Тогда
		Для Каждого ТекСтрокаАгрегат Из тблАгрегаты Цикл
			Если ЗначениеЗаполнено(ДокументСсылка.Прицеп1) И ТекСтрокаАгрегат.ТС = ДокументСсылка.Прицеп1 Тогда
				тблШины = тблШиныПрицеп1;
			ИначеЕсли ЗначениеЗаполнено(ДокументСсылка.Прицеп2) И ТекСтрокаАгрегат.ТС = ДокументСсылка.Прицеп2 Тогда
				тблШины = тблШиныПрицеп2;
			Иначе
				тблШины = тблШиныТС;
			КонецЕсли;
			
			Если ТекСтрокаАгрегат.СерияНоменклатуры.ТипАгрегата = Справочники.уатТипыАгрегатов.Шина
				И (ТекСтрокаАгрегат.Состояние = Перечисления.уатСостоянияАгрегатов.УстановленоВРаботе
				ИЛИ ТекСтрокаАгрегат.Состояние = Перечисления.уатСостоянияАгрегатов.УстановленоВЗапас
				ИЛИ ТекСтрокаАгрегат.Состояние = Перечисления.уатСостоянияАгрегатов.УстановленоНеисправно) Тогда
			
				мсвНайденныеСтроки = тблШины.НайтиСтроки(Новый Структура("МестоУстановки", ТекСтрокаАгрегат.МестоУстановки));
				Для Каждого НайденнаяСтрока Из мсвНайденныеСтроки Цикл
					Если НайденнаяСтрока.СерияНоменклатуры <> ТекСтрокаАгрегат.СерияНоменклатуры Тогда
						ТекстНСТР = НСтр("en='Tire ""%1"" is installed ""%2"" is already occupied by tire ""%3""!';ru='Шина ""%1"" установлена на место ""%2"", уже занятое шиной ""%3""!'");
						ТекстНСТР = СтрШаблон(ТекстНСТР, ТекСтрокаАгрегат.СерияНоменклатуры, СокрЛП(ТекСтрокаАгрегат.МестоУстановки), НайденнаяСтрока.СерияНоменклатуры);
						уатОбщегоНазначенияТиповые.СообщитьОбОшибке(ТекстНСТР, , , СтатусСообщения.Информация);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьКонтроль()

Функция ТСиПрицепыДокумента(ДокументСсылка) Экспорт
	мсвТС = Новый Массив;
	Если ЗначениеЗаполнено(ДокументСсылка.ТС) Тогда
		мсвТС.Добавить(ДокументСсылка.ТС);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДокументСсылка.Прицеп1) Тогда
		мсвТС.Добавить(ДокументСсылка.Прицеп1);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДокументСсылка.Прицеп2) Тогда
		мсвТС.Добавить(ДокументСсылка.Прицеп2);
	КонецЕсли;
	
	Возврат мсвТС;
КонецФункции

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ПечатьАктПриемаПередачиТС(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_АктПриемаПередачиТС";
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АктПриемаПередачиТС_Макет";
		Макет = Документы.уатАктПриемаПередачиТС.ПолучитьМакет("ПФ_MXL_АктПриемаПередачи");
		
		РезультатЗапроса = РезультатЗапросаДанныеДокумента(ТекущийДокумент);
		Выборка = РезультатЗапроса.Выбрать();

		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьШапкаСдал = Макет.ПолучитьОбласть("ШапкаСдал");
		ОбластьШапкаПринял = Макет.ПолучитьОбласть("ШапкаПринял");
		ОбластьШапкаПутевойЛист1 = Макет.ПолучитьОбласть("ШапкаПутевойЛист1");
		ОбластьШапкаПутевойЛист2 = Макет.ПолучитьОбласть("ШапкаПутевойЛист2");
		ОбластьШапкаСостояниеСалона = Макет.ПолучитьОбласть("ШапкаСостояниеСалона");
		ОбластьШапкаПримечаниеКСостояниюСалона = Макет.ПолучитьОбласть("ШапкаПримечаниеКСостояниюСалона");
				
		ОбластьШиныШапка = Макет.ПолучитьОбласть("ШиныШапка");
		ОбластьШины = Макет.ПолучитьОбласть("Шины");
		ОбластьАгрегатыШапка = Макет.ПолучитьОбласть("АгрегатыШапка");
		ОбластьАгрегаты = Макет.ПолучитьОбласть("Агрегаты");
		ОбластьКузовныеЭлементыШапка = Макет.ПолучитьОбласть("КузовныеЭлементыШапка");
		ОбластьКузовныеЭлементы = Макет.ПолучитьОбласть("КузовныеЭлементы");
		ОбластьЭлементыКомплектацииШапка = Макет.ПолучитьОбласть("ЭлементыКомплектацииШапка");
		ОбластьЭлементыКомплектации = Макет.ПолучитьОбласть("ЭлементыКомплектации");
		
		ОбластьПодвалСдал = Макет.ПолучитьОбласть("ПодвалСдал");
		ОбластьПодвалПринял = Макет.ПолучитьОбласть("ПодвалПринял");
		ОбластьПодвалОсмотрПровел = Макет.ПолучитьОбласть("ПодвалОсмотрПровел");
		ОбластьПодвалПустаяСтрока = Макет.ПолучитьОбласть("ПодвалПустаяСтрока");
		ОбластьПодвалШапкаОтветственные = Макет.ПолучитьОбласть("ПодвалШапкаОтветственные");
		ОбластьПодвалСтрокаОтветственные = Макет.ПолучитьОбласть("ПодвалСтрокаОтветственные");
		
		ТабличныйДокумент.Очистить();

		ВставлятьРазделительСтраниц = Ложь;
		Пока Выборка.Следующий() Цикл
			Если ВставлятьРазделительСтраниц Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ОбластьЗаголовок.Параметры.ТекстЗаголовка = ХозОперацияДляПечати(Выборка.ВидОперации) + " "
				+ уатОбщегоНазначенияТиповые.уатСформироватьЗаголовокДокумента(Выборка);
			ТабличныйДокумент.Вывести(ОбластьЗаголовок);

			ОбластьШапка.Параметры.Заполнить(Выборка);
			СведенияОбОрганизации = уатОбщегоНазначенияСервер.СведенияОЮрФизЛице(Выборка.Организация, Выборка.Дата);
			ОбластьШапка.Параметры.ОрганизацияПредставление = уатОбщегоНазначенияТиповыеСервер.ОписаниеОрганизации(
				СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,ИНН,КПП,ЮридическийАдрес,Телефоны,");
			ТабличныйДокумент.Вывести(ОбластьШапка, Выборка.Уровень());
			
			Если ЗначениеЗаполнено(Выборка.Сдал) Тогда
				ТекФизЛицо = ?(ТипЗнч(Выборка.Сдал) = Тип("СправочникСсылка.ФизическиеЛица"),
					Выборка.Сдал, Выборка.Сдал.ФизическоеЛицо);
				ОбластьШапкаСдал.Параметры.СдалИнформация =
					уатОбщегоНазначения.уатФИОСотрудникаПолноеСтрокой(ТекФизЛицо, Выборка.Дата) + "  " + 
					уатОбщегоНазначенияСервер.ПолучитьКонтактнуюИнформацию(
					ТекФизЛицо, Справочники.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица, Выборка.Дата);
				
				ТабличныйДокумент.Вывести(ОбластьШапкаСдал, Выборка.Уровень());
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Выборка.Принял) Тогда
				ТекФизЛицо = ?(ТипЗнч(Выборка.Принял) = Тип("СправочникСсылка.ФизическиеЛица"),
					Выборка.Принял, Выборка.Принял.ФизическоеЛицо);
				ОбластьШапкаПринял.Параметры.ПринялИнформация =
					уатОбщегоНазначения.уатФИОСотрудникаПолноеСтрокой(ТекФизЛицо, Выборка.Дата) + "  " + 
					уатОбщегоНазначенияСервер.ПолучитьКонтактнуюИнформацию(
					ТекФизЛицо, Справочники.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица, Выборка.Дата);
				
				ТабличныйДокумент.Вывести(ОбластьШапкаПринял, Выборка.Уровень());
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Выборка.ПутевойЛист1) Тогда
				ОбластьШапкаПутевойЛист1.Параметры.ПутевойЛист1 = Выборка.ПутевойЛист1;
				ТабличныйДокумент.Вывести(ОбластьШапкаПутевойЛист1, Выборка.Уровень());
			КонецЕсли;
			Если ЗначениеЗаполнено(Выборка.ПутевойЛист2) Тогда
				ОбластьШапкаПутевойЛист2.Параметры.ПутевойЛист2 = Выборка.ПутевойЛист2;
				ТабличныйДокумент.Вывести(ОбластьШапкаПутевойЛист2, Выборка.Уровень());
			КонецЕсли;
			
			ОбластьШапкаСостояниеСалона.Параметры.СостояниеСалонаТС = Выборка.СостояниеСалонаТС;
			ТабличныйДокумент.Вывести(ОбластьШапкаСостояниеСалона, Выборка.Уровень());
			
			ОбластьШапкаПримечаниеКСостояниюСалона.Параметры.Примечание = Выборка.ПримечаниеКСостояниюСалонаТС;
			ТабличныйДокумент.Вывести(ОбластьШапкаПримечаниеКСостояниюСалона, Выборка.Уровень());
						
			ВывестиКартинкуМакетаКузова(Выборка.ТС.Модель.МакетКузоваТС, Макет, ТабличныйДокумент);
			
			// прицепы
			Если ЗначениеЗаполнено(Выборка.Прицеп1) Тогда
				ОбластьШапкаПрицеп1 = Макет.ПолучитьОбласть("ШапкаПрицеп1");
				ОбластьШапкаПрицеп1.Параметры.Заполнить(Выборка);
				ТабличныйДокумент.Вывести(ОбластьШапкаПрицеп1, Выборка.Уровень());
				ВывестиКартинкуМакетаКузова(Выборка.Прицеп1.Модель.МакетКузоваТС, Макет, ТабличныйДокумент);
			КонецЕсли;
			Если ЗначениеЗаполнено(Выборка.Прицеп2) Тогда
				ОбластьШапкаПрицеп2 = Макет.ПолучитьОбласть("ШапкаПрицеп2");
				ОбластьШапкаПрицеп2.Параметры.Заполнить(Выборка);
				ТабличныйДокумент.Вывести(ОбластьШапкаПрицеп2, Выборка.Уровень());
				ВывестиКартинкуМакетаКузова(Выборка.Прицеп2.Модель.МакетКузоваТС, Макет, ТабличныйДокумент);
			КонецЕсли;
			
			ВыборкаШины = Выборка.Шины.Выбрать();
			Если ВыборкаШины.Количество() Тогда
				ТабличныйДокумент.Вывести(ОбластьШиныШапка);
				Пока ВыборкаШины.Следующий() Цикл
					ОбластьШины.Параметры.Заполнить(ВыборкаШины);
					ТабличныйДокумент.Вывести(ОбластьШины, ВыборкаШины.Уровень());
				КонецЦикла;
			КонецЕсли;
			
			ВывестиКартинкуМакетаШин(Выборка, Макет, ТабличныйДокумент, Истина);
			
			ВыборкаАгрегаты = Выборка.Агрегаты.Выбрать();
			Если ВыборкаАгрегаты.Количество() Тогда
				ТабличныйДокумент.Вывести(ОбластьАгрегатыШапка);
				Пока ВыборкаАгрегаты.Следующий() Цикл
					ОбластьАгрегаты.Параметры.Заполнить(ВыборкаАгрегаты);
					ТабличныйДокумент.Вывести(ОбластьАгрегаты, ВыборкаАгрегаты.Уровень());
				КонецЦикла;
			КонецЕсли;

			ВыборкаКузовныеЭлементы = Выборка.КузовныеЭлементы.Выбрать();
			Если ВыборкаКузовныеЭлементы.Количество() Тогда
				ТабличныйДокумент.Вывести(ОбластьКузовныеЭлементыШапка);
				Пока ВыборкаКузовныеЭлементы.Следующий() Цикл
					ОбластьКузовныеЭлементы.Параметры.Заполнить(ВыборкаКузовныеЭлементы);
					ТабличныйДокумент.Вывести(ОбластьКузовныеЭлементы, ВыборкаКузовныеЭлементы.Уровень());
				КонецЦикла;
			КонецЕсли;
			
			Если уатОбщегоНазначения_проф.ИспользоватьЭлементыКомплектации() Тогда
				ВыборкаЭлементыКомплектации = Выборка.ЭлементыКомплектации.Выбрать();
				Если ВыборкаЭлементыКомплектации.Количество() Тогда
					ТабличныйДокумент.Вывести(ОбластьЭлементыКомплектацииШапка);
					Пока ВыборкаЭлементыКомплектации.Следующий() Цикл
						ОбластьЭлементыКомплектации.Параметры.Заполнить(ВыборкаЭлементыКомплектации);
						ТабличныйДокумент.Вывести(ОбластьЭлементыКомплектации, ВыборкаЭлементыКомплектации.Уровень());
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьПодвалПустаяСтрока);
			
			Если Выборка.ВидОперации = Перечисления.уатВидыОперацийАктПриемаПередачи.ПриемОтВодителя
				ИЛИ Выборка.ВидОперации = Перечисления.уатВидыОперацийАктПриемаПередачи.ПередачаМеждуВодителями
				ИЛИ Выборка.ВидОперации = Перечисления.уатВидыОперацийАктПриемаПередачи.ПриемОтАрендатора Тогда
			    ОбластьПодвалСдал.Параметры.СдалДолжность = уатОбщегоНазначенияТиповые.ПолучитьДолжностьСотрудника(Выборка.Сдал, Выборка.ДатаОсмотра);
				ОбластьПодвалСдал.Параметры.СдалПредставление = уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(Выборка.Сдал);
				ТабличныйДокумент.Вывести(ОбластьПодвалСдал);
			КонецЕсли;
			Если Выборка.ВидОперации = Перечисления.уатВидыОперацийАктПриемаПередачи.ПередачаВодителю
				ИЛИ Выборка.ВидОперации = Перечисления.уатВидыОперацийАктПриемаПередачи.ПередачаМеждуВодителями
				ИЛИ Выборка.ВидОперации = Перечисления.уатВидыОперацийАктПриемаПередачи.ПередачаАрендатору Тогда
			    ОбластьПодвалПринял.Параметры.ПринялДолжность = уатОбщегоНазначенияТиповые.ПолучитьДолжностьСотрудника(Выборка.Принял, Выборка.ДатаОсмотра);
				ОбластьПодвалПринял.Параметры.ПринялПредставление = уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(Выборка.Принял);
				ТабличныйДокумент.Вывести(ОбластьПодвалПринял);
			КонецЕсли;
			Если Выборка.ВидОперации = Перечисления.уатВидыОперацийАктПриемаПередачи.Осмотр
				ИЛИ Выборка.ВидОперации = Перечисления.уатВидыОперацийАктПриемаПередачи.ПервичныйОсмотр Тогда
			    ОбластьПодвалОсмотрПровел.Параметры.ОсмотрПровелДолжность = уатОбщегоНазначенияТиповые.ПолучитьДолжностьСотрудника(Выборка.ОсмотрПровел, Выборка.ДатаОсмотра);
				ОбластьПодвалОсмотрПровел.Параметры.ОсмотрПровелПредставление = уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(Выборка.ОсмотрПровел);
				ТабличныйДокумент.Вывести(ОбластьПодвалОсмотрПровел);
			КонецЕсли;
			
			ВыборкаОтветственныеЛица = Выборка.ОтветственныеЛица.Выбрать();
			Если ВыборкаОтветственныеЛица.Количество() > 0 Тогда
				ТабличныйДокумент.Вывести(ОбластьПодвалПустаяСтрока);
				ТабличныйДокумент.Вывести(ОбластьПодвалШапкаОтветственные);
				Пока ВыборкаОтветственныеЛица.Следующий() Цикл
					ОбластьПодвалСтрокаОтветственные.Параметры.Заполнить(ВыборкаОтветственныеЛица);
					ОбластьПодвалСтрокаОтветственные.Параметры.ФизическоеЛицоПредставление =
						уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ВыборкаОтветственныеЛица.ФизическоеЛицо); 
					ТабличныйДокумент.Вывести(ОбластьПодвалСтрокаОтветственные, ВыборкаОтветственныеЛица.Уровень());
				КонецЦикла;
			КонецЕсли;
			
			ВставлятьРазделительСтраниц = Истина;
		КонецЦикла;

		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
		
	КонецЦикла;

	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьАктПриемаПередачиТСПредыдущееСостояние(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_АктПриемаПередачиТС_ПредыдущееСостояние";
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АктПриемаПередачиТС_ПредыдущееСостояние_Макет";
		Макет = Документы.уатАктПриемаПередачиТС.ПолучитьМакет("ПФ_MXL_АктПриемаПередачи");
				
		РезультатЗапроса = РезультатЗапросаДанныеДокумента(ТекущийДокумент);
		Выборка = РезультатЗапроса.Выбрать();
		
		тблШиныПред = уатОбщегоНазначения.уатШиныТС(ТСиПрицепыДокумента(ТекущийДокумент),
			ТекущийДокумент.ДатаОсмотра-1);
		тблАгрегатыПред = уатОбщегоНазначения.уатАгрегатыТСКромеШин(ТСиПрицепыДокумента(ТекущийДокумент),
			ТекущийДокумент.ДатаОсмотра-1);
		тблКузовныеЭлементыПред = уатОбщегоНазначения_проф.уатКузовныеЭлементыТС(ТСиПрицепыДокумента(ТекущийДокумент),
			ТекущийДокумент.ДатаОсмотра-1);
	
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьШапкаСдал = Макет.ПолучитьОбласть("ШапкаСдал");
		ОбластьШапкаПринял = Макет.ПолучитьОбласть("ШапкаПринял");
		ОбластьШапкаПутевойЛист1 = Макет.ПолучитьОбласть("ШапкаПутевойЛист1");
		ОбластьШапкаПутевойЛист2 = Макет.ПолучитьОбласть("ШапкаПутевойЛист2");
		ОбластьШапкаСостояниеСалона = Макет.ПолучитьОбласть("ШапкаСостояниеСалона");
		ОбластьШапкаПримечаниеКСостояниюСалона = Макет.ПолучитьОбласть("ШапкаПримечаниеКСостояниюСалона");
		
		ОбластьШиныШапка = Макет.ПолучитьОбласть("ШиныШапкаПредыдущее");
		ОбластьШины = Макет.ПолучитьОбласть("ШиныПредыдущее");
		ОбластьАгрегатыШапка = Макет.ПолучитьОбласть("АгрегатыШапкаПредыдущее");
		ОбластьАгрегаты = Макет.ПолучитьОбласть("АгрегатыПредыдущее");
		ОбластьКузовныеЭлементыШапка = Макет.ПолучитьОбласть("КузовныеЭлементыШапкаПредыдущее");
		ОбластьКузовныеЭлементы = Макет.ПолучитьОбласть("КузовныеЭлементыПредыдущее");
		ОбластьЭлементыКомплектацииШапка = Макет.ПолучитьОбласть("ЭлементыКомплектацииШапкаПредыдущее");
		ОбластьЭлементыКомплектации = Макет.ПолучитьОбласть("ЭлементыКомплектацииПредыдущее");
		
		ОбластьПодвалСдал = Макет.ПолучитьОбласть("ПодвалСдал");
		ОбластьПодвалПринял = Макет.ПолучитьОбласть("ПодвалПринял");
		ОбластьПодвалОсмотрПровел = Макет.ПолучитьОбласть("ПодвалОсмотрПровел");
		ОбластьПодвалПустаяСтрока = Макет.ПолучитьОбласть("ПодвалПустаяСтрока");
		ОбластьПодвалШапкаОтветственные = Макет.ПолучитьОбласть("ПодвалШапкаОтветственные");
		ОбластьПодвалСтрокаОтветственные = Макет.ПолучитьОбласть("ПодвалСтрокаОтветственные");
		
		ТабличныйДокумент.Очистить();

		ВставлятьРазделительСтраниц = Ложь;
		Пока Выборка.Следующий() Цикл
			Если ВставлятьРазделительСтраниц Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ОбластьЗаголовок.Параметры.ТекстЗаголовка = ХозОперацияДляПечати(Выборка.ВидОперации) + " "
				+ уатОбщегоНазначенияТиповые.уатСформироватьЗаголовокДокумента(Выборка);
			ТабличныйДокумент.Вывести(ОбластьЗаголовок);

			ОбластьШапка.Параметры.Заполнить(Выборка);
			СведенияОбОрганизации = уатОбщегоНазначенияСервер.СведенияОЮрФизЛице(Выборка.Организация, Выборка.Дата);
			ОбластьШапка.Параметры.ОрганизацияПредставление = уатОбщегоНазначенияТиповыеСервер.ОписаниеОрганизации(
				СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,ИНН,КПП,ЮридическийАдрес,Телефоны,");
			ТабличныйДокумент.Вывести(ОбластьШапка, Выборка.Уровень());
			
			Если ЗначениеЗаполнено(Выборка.Сдал) Тогда
				ТекФизЛицо = ?(ТипЗнч(Выборка.Сдал) = Тип("СправочникСсылка.ФизическиеЛица"),
					Выборка.Сдал, Выборка.Сдал.ФизическоеЛицо);
				ОбластьШапкаСдал.Параметры.СдалИнформация =
					уатОбщегоНазначения.уатФИОСотрудникаПолноеСтрокой(ТекФизЛицо, Выборка.Дата) + "  " + 
					уатОбщегоНазначенияСервер.ПолучитьКонтактнуюИнформацию(
					ТекФизЛицо, Справочники.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица, Выборка.Дата);
				
				ТабличныйДокумент.Вывести(ОбластьШапкаСдал, Выборка.Уровень());
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Выборка.Принял) Тогда
				ТекФизЛицо = ?(ТипЗнч(Выборка.Принял) = Тип("СправочникСсылка.ФизическиеЛица"),
					Выборка.Принял, Выборка.Принял.ФизическоеЛицо);
				ОбластьШапкаПринял.Параметры.ПринялИнформация =
					уатОбщегоНазначения.уатФИОСотрудникаПолноеСтрокой(ТекФизЛицо, Выборка.Дата) + "  " + 
					уатОбщегоНазначенияСервер.ПолучитьКонтактнуюИнформацию(
					ТекФизЛицо, Справочники.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица, Выборка.Дата);
				
				ТабличныйДокумент.Вывести(ОбластьШапкаПринял, Выборка.Уровень());
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Выборка.ПутевойЛист1) Тогда
				ОбластьШапкаПутевойЛист1.Параметры.ПутевойЛист1 = Выборка.ПутевойЛист1;
				ТабличныйДокумент.Вывести(ОбластьШапкаПутевойЛист1, Выборка.Уровень());
			КонецЕсли;
			Если ЗначениеЗаполнено(Выборка.ПутевойЛист2) Тогда
				ОбластьШапкаПутевойЛист2.Параметры.ПутевойЛист2 = Выборка.ПутевойЛист2;
				ТабличныйДокумент.Вывести(ОбластьШапкаПутевойЛист2, Выборка.Уровень());
			КонецЕсли;
			
			ОбластьШапкаСостояниеСалона.Параметры.СостояниеСалонаТС = Выборка.СостояниеСалонаТС;
			ТабличныйДокумент.Вывести(ОбластьШапкаСостояниеСалона, Выборка.Уровень());
			
			ОбластьШапкаПримечаниеКСостояниюСалона.Параметры.Примечание = Выборка.ПримечаниеКСостояниюСалонаТС;
			ТабличныйДокумент.Вывести(ОбластьШапкаПримечаниеКСостояниюСалона, Выборка.Уровень());
			
			ВывестиКартинкуМакетаКузова(Выборка.ТС.Модель.МакетКузоваТС, Макет, ТабличныйДокумент);
			
			// прицепы
			Если ЗначениеЗаполнено(Выборка.Прицеп1) Тогда
				ОбластьШапкаПрицеп1 = Макет.ПолучитьОбласть("ШапкаПрицеп1");
				ОбластьШапкаПрицеп1.Параметры.Заполнить(Выборка);
				ТабличныйДокумент.Вывести(ОбластьШапкаПрицеп1, Выборка.Уровень());
				ВывестиКартинкуМакетаКузова(Выборка.Прицеп1.Модель.МакетКузоваТС, Макет, ТабличныйДокумент);
			КонецЕсли;
			Если ЗначениеЗаполнено(Выборка.Прицеп2) Тогда
				ОбластьШапкаПрицеп2 = Макет.ПолучитьОбласть("ШапкаПрицеп2");
				ОбластьШапкаПрицеп2.Параметры.Заполнить(Выборка);
				ТабличныйДокумент.Вывести(ОбластьШапкаПрицеп2, Выборка.Уровень());
				ВывестиКартинкуМакетаКузова(Выборка.Прицеп2.Модель.МакетКузоваТС, Макет, ТабличныйДокумент);
			КонецЕсли;
			
			ВыборкаШины = Выборка.Шины.Выбрать();
			Если ВыборкаШины.Количество() Тогда
				ТабличныйДокумент.Вывести(ОбластьШиныШапка);
				Пока ВыборкаШины.Следующий() Цикл
					ОбластьШины.Параметры.Заполнить(ВыборкаШины);
					
					мсвСтрокиПоиск = тблШиныПред.НайтиСтроки(Новый Структура("ТС, СерияНоменклатуры",
						ВыборкаШины.ТС, ВыборкаШины.СерияНоменклатуры));
					Если мсвСтрокиПоиск.Количество() > 0 Тогда
						ОбластьШины.Параметры.Состояние      = мсвСтрокиПоиск[0].Состояние;
						ОбластьШины.Параметры.МестоУстановки = мсвСтрокиПоиск[0].МестоУстановки;
						ОбластьШины.Параметры.СтепеньИзноса  = мсвСтрокиПоиск[0].СтепеньИзноса;
					КонецЕсли;
					
					ТабличныйДокумент.Вывести(ОбластьШины, ВыборкаШины.Уровень());
				КонецЦикла;
			КонецЕсли;
			
			ВывестиКартинкуМакетаШин(Выборка, Макет, ТабличныйДокумент, Ложь);
			
			ВыборкаАгрегаты = Выборка.Агрегаты.Выбрать();
			Если ВыборкаАгрегаты.Количество() Тогда
				ТабличныйДокумент.Вывести(ОбластьАгрегатыШапка);
				Пока ВыборкаАгрегаты.Следующий() Цикл
					ОбластьАгрегаты.Параметры.Заполнить(ВыборкаАгрегаты);
					
					мсвСтрокиПоиск = тблАгрегатыПред.НайтиСтроки(Новый Структура("ТС, СерияНоменклатуры",
						ВыборкаАгрегаты.ТС, ВыборкаАгрегаты.СерияНоменклатуры));
					Если мсвСтрокиПоиск.Количество() > 0 Тогда
						ОбластьАгрегаты.Параметры.Состояние = мсвСтрокиПоиск[0].Состояние;
					КонецЕсли;
					
					ТабличныйДокумент.Вывести(ОбластьАгрегаты, ВыборкаАгрегаты.Уровень());
				КонецЦикла;
			КонецЕсли;

			ВыборкаКузовныеЭлементы = Выборка.КузовныеЭлементы.Выбрать();
			Если ВыборкаКузовныеЭлементы.Количество() Тогда
				ТабличныйДокумент.Вывести(ОбластьКузовныеЭлементыШапка);
				Пока ВыборкаКузовныеЭлементы.Следующий() Цикл
					ОбластьКузовныеЭлементы.Параметры.Заполнить(ВыборкаКузовныеЭлементы);
					
					мсвСтрокиПоиск = тблКузовныеЭлементыПред.НайтиСтроки(Новый Структура("ТС, КузовнойЭлемент",
						ВыборкаКузовныеЭлементы.ТС, ВыборкаКузовныеЭлементы.КузовнойЭлемент));
					Если мсвСтрокиПоиск.Количество() > 0 Тогда
						ОбластьКузовныеЭлементы.Параметры.Состояние = мсвСтрокиПоиск[0].Состояние;
						ОбластьКузовныеЭлементы.Параметры.ХарактерПовреждений = мсвСтрокиПоиск[0].ХарактерПовреждений;
						
						Если мсвСтрокиПоиск[0].НаличиеПовреждений И НЕ ЗначениеЗаполнено(мсвСтрокиПоиск[0].ХарактерПовреждений) Тогда
							ОбластьКузовныеЭлементы.Параметры.ХарактерПовреждений = "Да";
						КонецЕсли;
					КонецЕсли;
					
					ТабличныйДокумент.Вывести(ОбластьКузовныеЭлементы, ВыборкаКузовныеЭлементы.Уровень());
				КонецЦикла;
			КонецЕсли;
			
			Если уатОбщегоНазначения_проф.ИспользоватьЭлементыКомплектации() Тогда
				ВыборкаЭлементыКомплектации = Выборка.ЭлементыКомплектации.Выбрать();
				Если ВыборкаЭлементыКомплектации.Количество() Тогда
					ТабличныйДокумент.Вывести(ОбластьЭлементыКомплектацииШапка);
					Пока ВыборкаЭлементыКомплектации.Следующий() Цикл
						ОбластьЭлементыКомплектации.Параметры.Заполнить(ВыборкаЭлементыКомплектации);
						Если ВыборкаЭлементыКомплектации.НаличиеПовреждений
							И НЕ ЗначениеЗаполнено(ВыборкаЭлементыКомплектации.ХарактерПовреждений) Тогда
							
							ОбластьЭлементыКомплектации.Параметры.ХарактерПовреждений = "Да";
						КонецЕсли;
						ТабличныйДокумент.Вывести(ОбластьЭлементыКомплектации, ВыборкаЭлементыКомплектации.Уровень());
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьПодвалПустаяСтрока);
			
			Если Выборка.ВидОперации = Перечисления.уатВидыОперацийАктПриемаПередачи.ПриемОтВодителя
				ИЛИ Выборка.ВидОперации = Перечисления.уатВидыОперацийАктПриемаПередачи.ПередачаМеждуВодителями
				ИЛИ Выборка.ВидОперации = Перечисления.уатВидыОперацийАктПриемаПередачи.ПриемОтАрендатора Тогда
			    ОбластьПодвалСдал.Параметры.СдалДолжность = уатОбщегоНазначенияТиповые.ПолучитьДолжностьСотрудника(Выборка.Сдал, Выборка.ДатаОсмотра);
				ОбластьПодвалСдал.Параметры.СдалПредставление = уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(Выборка.Сдал);
				ТабличныйДокумент.Вывести(ОбластьПодвалСдал);
			КонецЕсли;
			Если Выборка.ВидОперации = Перечисления.уатВидыОперацийАктПриемаПередачи.ПередачаВодителю
				ИЛИ Выборка.ВидОперации = Перечисления.уатВидыОперацийАктПриемаПередачи.ПередачаМеждуВодителями
				ИЛИ Выборка.ВидОперации = Перечисления.уатВидыОперацийАктПриемаПередачи.ПередачаАрендатору Тогда
			    ОбластьПодвалПринял.Параметры.ПринялДолжность = уатОбщегоНазначенияТиповые.ПолучитьДолжностьСотрудника(Выборка.Принял, Выборка.ДатаОсмотра);
				ОбластьПодвалПринял.Параметры.ПринялПредставление = уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(Выборка.Принял);
				ТабличныйДокумент.Вывести(ОбластьПодвалПринял);
			КонецЕсли;
			Если Выборка.ВидОперации = Перечисления.уатВидыОперацийАктПриемаПередачи.Осмотр
				ИЛИ Выборка.ВидОперации = Перечисления.уатВидыОперацийАктПриемаПередачи.ПервичныйОсмотр Тогда
			    ОбластьПодвалОсмотрПровел.Параметры.ОсмотрПровелДолжность = уатОбщегоНазначенияТиповые.ПолучитьДолжностьСотрудника(Выборка.ОсмотрПровел, Выборка.ДатаОсмотра);
				ОбластьПодвалОсмотрПровел.Параметры.ОсмотрПровелПредставление = уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(Выборка.ОсмотрПровел);
				ТабличныйДокумент.Вывести(ОбластьПодвалОсмотрПровел);
			КонецЕсли;
			
			ВыборкаОтветственныеЛица = Выборка.ОтветственныеЛица.Выбрать();
			Если ВыборкаОтветственныеЛица.Количество() > 0 Тогда
				ТабличныйДокумент.Вывести(ОбластьПодвалПустаяСтрока);
				ТабличныйДокумент.Вывести(ОбластьПодвалШапкаОтветственные);
				Пока ВыборкаОтветственныеЛица.Следующий() Цикл
					ОбластьПодвалСтрокаОтветственные.Параметры.Заполнить(ВыборкаОтветственныеЛица);
					ОбластьПодвалСтрокаОтветственные.Параметры.ФизическоеЛицоПредставление =
						уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ВыборкаОтветственныеЛица.ФизическоеЛицо); 
					ТабличныйДокумент.Вывести(ОбластьПодвалСтрокаОтветственные, ВыборкаОтветственныеЛица.Уровень());
				КонецЦикла;
			КонецЕсли;
			
			ВставлятьРазделительСтраниц = Истина;
		КонецЦикла;

		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
		
	КонецЦикла;

	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Процедура ВывестиКартинкуМакетаКузова(МакетКузова, Макет, ТабличныйДокумент)
	
	Если НЕ ЗначениеЗаполнено(МакетКузова) Тогда
		Возврат;
	КонецЕсли;
	
	КартинкаМакета = ПолучитьКартинкуМакета(МакетКузова);
	Если КартинкаМакета <> Неопределено Тогда 
		ОбластьМакета = Макет.ПолучитьОбласть("МакетКузова");
		
		Рисунок = ОбластьМакета.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
		Рисунок.РазмерКартинки = РазмерКартинки.Пропорционально;
		Рисунок.Картинка = КартинкаМакета;
		Рисунок.Верх   = 0; 
		Рисунок.Высота = 80;
		Рисунок.Ширина = 150;
		Рисунок.Лево   = 0;
		Рисунок.ГраницаСверху = Ложь;
		Рисунок.ГраницаСлева = Ложь;
		Рисунок.ГраницаСнизу = Ложь;
		Рисунок.ГраницаСправа = Ложь;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
	КонецЕсли;
		
КонецПроцедуры

Процедура ВывестиКартинкуМакетаШин(Выборка, Макет, ТабличныйДокумент, ОтображатьКартинкиШин = Ложь)
	
	мсвТС = Новый Массив;
	мсвТС.Добавить(Выборка.ТС);
	мсвТС.Добавить(Выборка.Прицеп1);
	мсвТС.Добавить(Выборка.Прицеп2);
	
	Для Каждого ТекТС Из мсвТС Цикл
		МакетТС = ТекТС.Модель.МакетТС;
		Если НЕ ЗначениеЗаполнено(МакетТС) Тогда
			Продолжить;
		КонецЕсли; 
		
		тблШиныТС = уатОбщегоНазначения.уатШиныТС(ТекТС, Выборка.ДатаОсмотра);
		
		ШиринаМакета = 45;
		КартинкаМакета = ПолучитьКартинкуМакета(МакетТС, ШиринаМакета);
		Если КартинкаМакета <> Неопределено Тогда 
			ОбластьМакета = Макет.ПолучитьОбласть("МакетШин");
			
			Рисунок = ОбластьМакета.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
			Рисунок.Верх = 5; 
			Рисунок.Лево = 22;
			Рисунок.Высота = 80;
			Рисунок.Ширина = ШиринаМакета;
			Рисунок.РазмерКартинки = РазмерКартинки.Пропорционально;
			Рисунок.Картинка = КартинкаМакета;
			Рисунок.ГраницаСверху = Ложь;
			Рисунок.ГраницаСлева  = Ложь;
			Рисунок.ГраницаСнизу  = Ложь;
			Рисунок.ГраницаСправа = Ложь;
			//Рисунок.ЦветЛинии = ЦветаСтиля.ЦветРамки;
			
			// Таблица шин
			ТаблицаКоординатШин = ТаблицаКоординатШин(ШиринаМакета);
			НастройкаМакетаТСДерево = МакетТС.ДеревоМакета.Получить();
			Если НастройкаМакетаТСДерево <> Неопределено Тогда
				ВеткаШины = НастройкаМакетаТСДерево.Строки.Найти("Шины", "Объект");
				Если ВеткаШины <> Неопределено Тогда
					Для Каждого ТекСтрокаШины Из ВеткаШины.Строки Цикл
						МестоУстановкиШины = СтрЗаменить(ТекСтрокаШины.Объект, "Шина_", "");
						Попытка
							ШинаУстановлена = тблШиныТС.Найти(Справочники.уатМестаУстановкиШин[МестоУстановкиШины],
								"МестоУстановки") <> Неопределено;
						Исключение
							ШинаУстановлена = Ложь;
						КонецПопытки;
						
						Для Каждого ТекСтрокаНастройкаШины Из ТекСтрокаШины.Строки Цикл
							Если ТекСтрокаНастройкаШины.Объект = "Установлено" И ТекСтрокаНастройкаШины.Значение = ИСТИНА Тогда
								СтрокаКоординатШина = ТаблицаКоординатШин.Найти(МестоУстановкиШины, "МестоУстановки");
								Если СтрокаКоординатШина <> Неопределено Тогда
									Рисунок = ОбластьМакета.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
									Рисунок.Верх = СтрокаКоординатШина.Верх; 
									Рисунок.Лево = СтрокаКоординатШина.Лево;
									Рисунок.Высота = СтрокаКоординатШина.Высота;
									Рисунок.Ширина = СтрокаКоординатШина.Ширина;
									Рисунок.ГраницаСверху = Истина;
									Рисунок.ГраницаСлева  = Истина;
									Рисунок.ГраницаСнизу  = Истина;
									Рисунок.ГраницаСправа = Истина;
									Рисунок.ЦветЛинии = ЦветаСтиля.ЦветРамки;
									
									Если ШинаУстановлена И ОтображатьКартинкиШин Тогда
										Рисунок.Картинка = ?(МестоУстановкиШины = "ЗАП", БиблиотекаКартинок.уатШина90, БиблиотекаКартинок.уатШина);
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция РезультатЗапросаДанныеДокумента(ДокументСсылка)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	уатАктПриемаПередачиТС.Дата,
	|	уатАктПриемаПередачиТС.Номер,
	|	уатАктПриемаПередачиТС.ВидОперации,
	|	уатАктПриемаПередачиТС.ДатаОсмотра,
	|	уатАктПриемаПередачиТС.Организация,
	|	уатАктПриемаПередачиТС.Одометр,
	|	уатАктПриемаПередачиТС.ОстатокТоплива,
	|	уатАктПриемаПередачиТС.Замечания,
	|	уатАктПриемаПередачиТС.ТС,
	|	уатАктПриемаПередачиТС.ТС.Модель КАК МодельТС,
	|	уатАктПриемаПередачиТС.ТС.ГосударственныйНомер КАК ГосНомер,
	|	уатАктПриемаПередачиТС.СостояниеСалонаТС,
	|	уатАктПриемаПередачиТС.ПримечаниеКСостояниюСалонаТС,
	|	уатАктПриемаПередачиТС.Прицеп1,
	|	уатАктПриемаПередачиТС.Прицеп1.Модель КАК МодельПрицепа1,
	|	уатАктПриемаПередачиТС.Прицеп1.ГосударственныйНомер КАК ГосНомерПрицепа1,
	|	уатАктПриемаПередачиТС.СостояниеГрузовогоОтсекаПрицепа1,
	|	уатАктПриемаПередачиТС.ПримечаниеКСостояниюГрузовогоОтсекаПрицепа1,
	|	уатАктПриемаПередачиТС.Прицеп2,
	|	уатАктПриемаПередачиТС.Прицеп2.Модель КАК МодельПрицепа2,
	|	уатАктПриемаПередачиТС.Прицеп2.ГосударственныйНомер КАК ГосНомерПрицепа2,
	|	уатАктПриемаПередачиТС.СостояниеГрузовогоОтсекаПрицепа2,
	|	уатАктПриемаПередачиТС.ПримечаниеКСостояниюГрузовогоОтсекаПрицепа2,
	|	уатАктПриемаПередачиТС.ПунктОсмотраТС,
	|	уатАктПриемаПередачиТС.ПутевойЛист1,
	|	уатАктПриемаПередачиТС.ПутевойЛист2,
	|	уатАктПриемаПередачиТС.Сдал,
	|	уатАктПриемаПередачиТС.Принял,
	|	уатАктПриемаПередачиТС.ОсмотрПровел,
	|	уатАктПриемаПередачиТС.Шины.(
	|		НомерСтроки,
	|		ТС,
	|		СерияНоменклатуры,
	|		МестоУстановки,
	|		Состояние,
	|		СтепеньИзноса
	|	),
	|	уатАктПриемаПередачиТС.Агрегаты.(
	|		НомерСтроки,
	|		ТС,
	|		СерияНоменклатуры,
	|		Состояние,
	|		0
	|	),
	|	уатАктПриемаПередачиТС.КузовныеЭлементы.(
	|		НомерСтроки,
	|		ТС,
	|		КузовнойЭлемент,
	|		Состояние,
	|		НаличиеПовреждений,
	|		ХарактерПовреждений
	|	),
	|	уатАктПриемаПередачиТС.ЭлементыКомплектации.(
	|		НомерСтроки,
	|		ТС,
	|		ЭлементКомплектации,
	|		Состояние,
	|		НаличиеПовреждений,
	|		ХарактерПовреждений,
	|		Количество
	|	),
	|	уатАктПриемаПередачиТС.ОтветственныеЛица.(
	|		ФизическоеЛицо,
	|		Должность
	|	)
	|ИЗ
	|	Документ.уатАктПриемаПередачиТС КАК уатАктПриемаПередачиТС
	|ГДЕ
	|	уатАктПриемаПередачиТС.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", ДокументСсылка);
	
	Возврат Запрос.Выполнить();
КонецФункции
	
Функция ПолучитьКартинкуМакета(МакетТС, ШиринаМакета = Неопределено)
	КартинкаМакета = Неопределено;
	ШиринаМакета = 45; // по умолчанию
	
	ХранилищеМакета = МакетТС.ХранилищеМакета.Получить();
	Если ТипЗнч(ХранилищеМакета) = Тип("Картинка") Тогда
		КартинкаМакета = ХранилищеМакета;
	ИначеЕсли ТипЗнч(ХранилищеМакета) = Тип("Структура") Тогда
		Если ХранилищеМакета.Свойство("Файл") Тогда
			КартинкаМакета = Новый Картинка(ХранилищеМакета.Файл);
		ИначеЕсли ХранилищеМакета.Свойство("Макет") Тогда
			КартинкаМакета = ХранилищеМакета.Макет;
		КонецЕсли;
		Если ХранилищеМакета.Свойство("ШиринаМакета") Тогда
			ШиринаМакета = ХранилищеМакета.ШиринаМакета;
		КонецЕсли;
	КонецЕсли;
	
	Возврат КартинкаМакета;
КонецФункции

Функция ТаблицаКоординатШин(ШиринаМакетаКузова)
	
	Макет = Документы.уатАктПриемаПередачиТС.ПолучитьМакет("КоординатыШин");
	
	Рез = Новый ТаблицаЗначений;
	Рез.Колонки.Добавить("МестоУстановки");
	Рез.Колонки.Добавить("Лево");
	Рез.Колонки.Добавить("Верх");
	Рез.Колонки.Добавить("Высота");
	Рез.Колонки.Добавить("Ширина");
		
	Для Сч = 2 По Макет.ВысотаТаблицы Цикл
		НоваяСтрока = Рез.Добавить();
		НоваяСтрока.МестоУстановки = Макет.Область(Сч, 1, Сч, 1).Текст;
		НоваяСтрока.Лево = Число(Макет.Область(Сч, 2, Сч, 2).Текст);
		НоваяСтрока.Верх = Число(Макет.Область(Сч, 3, Сч, 3).Текст);
		НоваяСтрока.Ширина = Число(Макет.Область(Сч, 4, Сч, 4).Текст);
		НоваяСтрока.Высота = Число(Макет.Область(Сч, 5, Сч, 5).Текст);
		
		Если ШиринаМакетаКузова > 0 Тогда
			Если НоваяСтрока.МестоУстановки = "ЗАП" Тогда
				НоваяСтрока.Лево = НоваяСтрока.Лево + Окр((ШиринаМакетаКузова - 32)/2);
			ИначеЕсли СтрНайти("ПП,ДЗПВ,ДЗПН,ЗП,ЗПВ,ЗПН,СПВ,СПН", НоваяСтрока.МестоУстановки) <> 0 Тогда
				НоваяСтрока.Лево = НоваяСтрока.Лево + (ШиринаМакетаКузова - 32);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Рез;
	
КонецФункции

Функция ХозОперацияДляПечати(ВидОперации)

	Если ВидОперации = Перечисления.уатВидыОперацийАктПриемаПередачи.Осмотр Тогда
		Возврат "Акт осмотра ТС";
	ИначеЕсли ВидОперации = Перечисления.уатВидыОперацийАктПриемаПередачи.ПервичныйОсмотр Тогда
		Возврат "Акт первичного осмотра ТС";
	ИначеЕсли ВидОперации = Перечисления.уатВидыОперацийАктПриемаПередачи.ПередачаАрендатору Тогда
		Возврат "Акт передачи ТС арендатору";
	ИначеЕсли ВидОперации = Перечисления.уатВидыОперацийАктПриемаПередачи.ПередачаВодителю Тогда
		Возврат "Акт передачи ТС водителю";
	ИначеЕсли ВидОперации = Перечисления.уатВидыОперацийАктПриемаПередачи.ПередачаМеждуВодителями Тогда
		Возврат "Акт передачи ТС между водителями";
	ИначеЕсли ВидОперации = Перечисления.уатВидыОперацийАктПриемаПередачи.ПриемОтАрендатора Тогда
		Возврат "Акт приема ТС от арендатора";
	ИначеЕсли ВидОперации = Перечисления.уатВидыОперацийАктПриемаПередачи.ПриемОтВодителя Тогда
		Возврат "Акт приема ТС от водителя";
	Иначе
		Возврат "Акт приема-передачи ТС";
	КонецЕсли;

КонецФункции

#КонецОбласти

#КонецЕсли
